Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionFormatAttributes.Format Property
 The format of the dimension.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes.DimensionValueFormats Format { get; set; }
Public Property Format As DimensionSetBaseAttributes.DimensionValueFormats
	Get
	Set
Property Value
Type: DimensionSetBaseAttributes.DimensionValueFormats
See Also
Reference
DimensionSetBaseAttributes.DimensionFormatAttributes Class
Tekla.Structures.Drawing Namespace